{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "decoder": {
    "add_cross_attention": true,
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 512,
    "is_decoder": true,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 4,
    "num_hidden_layers": 4,
    "pad_token_id": 2,
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 37
  },
  "decoder_start_token_id": 3,
  "encoder": {
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 512,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 4,
    "num_hidden_layers": 4,
    "pad_token_id": 1,
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 44
  },
  "is_encoder_decoder": true,
  "model_type": "encoder-decoder",
  "pad_token_id": 2,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
